{
  "spotlight": [
    {
      "title": "Kaiju No. 8 Season 2",
      "description": "After the destruction of their hometown, childhood friends Kafka Hibino and Mina Ashiro make a pact to become officers in the Defense Force—a militarized organization tasked with protecting Japan from colossal monsters known as \"kaijuu.\" Decades later, the 32-year-old Kafka has all but given up on his dreams of heroism. Instead, he cleans up the remains of the slaughtered kaijuu after they are defeated by valiant soldiers—including Mina, who has successfully achieved their shared goal.\r\n\r\nUpon meeting his new coworker, Reno Ichikawa, Kafka faces a mirror of his past self: an ambitious young man whose one desire is to fight as a member of the Defense Force. Unfortunately, the two are soon involved in a freak encounter with a rogue kaijuu. Though Kafka demonstrates his innate heroic nature and rescues Reno from certain doom, he is left gravely injured.\r\n\r\nWhile both men recover in a hospital, Kafka is seemingly attacked by another one of the beasts. As a result, he gains the ability to transform into a humanoid kaijuu with the strength and powers of the massive monsters menacing Japan. Dubbed \"Kaijuu No. 8\" by the military, Kafka resolves to use his newfound gifts for the greater good. Tied together by mutual respect, Kafka and Reno set out to join warriors like Mina at the forefront of the Defense Force.",
      "watch_url": "https://aniwatchtv.to/watch/kaiju-no-8-season-2-19792",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/6461c9a2f865136afa30424ea61586be.jpg",
      "stream_url": ""
    },
    {
      "title": "My Dress-Up Darling Season 2",
      "description": "The second season of Sono Bisque Doll wa Koi wo Suru.\r\n\r\nWhen Marin Kitagawa and Wakana Gojo met, they grew close over their love for cosplay. Through interacting with classmates and making new cosplay friends, Marin and Wakana’s world keeps growing. New developments arise as Marin’s love for Wakana continues to be filled with endless excitement. In their ever-expanding world, Marin and Wakana’s story of cosplay and thrills continues!",
      "watch_url": "https://aniwatchtv.to/watch/my-dress-up-darling-season-2-19794",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/efe80a55370f96edc544fb3d16c4b16f.jpg",
      "stream_url": ""
    },
    {
      "title": "Dan Da Dan Season 2",
      "description": "While the mission to exorcise Jin \"Jiji\" Enjouji's family home is underway, things are not going as expected. Momo Ayase narrowly evades an attempted abduction while Ken \"Okarun\" Takakura and Jiji are ambushed by the Kitou family—the unsettling landlords of the cursed estate. The trio's efforts threaten the foundation of this enigmatic town shrouded in legends and mysteries.\r\n\r\nAs Momo, Okarun, and Jiji are drawn deeper into the maze of folklore and supernatural entities, they must each utilize their unique powers if they want to survive and unravel the secrets of the uncanny town.",
      "watch_url": "https://aniwatchtv.to/watch/dan-da-dan-season-2-19793",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/33043b5bb1314a46d20f814dbe70f123.jpg",
      "stream_url": ""
    },
    {
      "title": "Dr. Stone: Science Future Part 2",
      "description": "After a strategic maneuver, Senkuu Ishigami's team stalls Dr. Xeno's more scientifically advanced forces. A ceasefire between the two factions allows for the establishment of Corn City in North America, a hope for a future thriving population. Meanwhile, Senkuu and some of his teammates rush toward the Amazon in South America—the epicenter of the petrification beam's impact—to create Superalloy City and progress their spaceship project.\r\n\r\nWith dangerous enemies still pursuing Senkuu and his companions, it is a race against time to reach the heart of the dense Amazon. As unexpected allies and scientific creations further fuel this leg of their journey, Senkuu is closer than ever to finally uncovering the mystery behind the petrification phenomenon.",
      "watch_url": "https://aniwatchtv.to/watch/dr-stone-science-future-part-2-19784",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/03d6a1cd6d2d48fc348f9cfb4dabc2ec.jpg",
      "stream_url": ""
    },
    {
      "title": "I Was Reincarnated as the 7th Prince so I Can Take My Time Perfecting My Magical Ability Season 2",
      "description": "The qualities valued most in the study of magic are bloodline, aptitude, and effort. There was one sorcerer who, despite his deep love for magic, was born a commoner and thus lacked the bloodline and aptitude for it. As he died an unnatural death, he wished he had studied magic more while he had the chance. Then, he was reincarnated as Lloyd, the seventh prince of the Kingdom of Saloum and one blessed with a strong magical bloodline. Reborn with all his memories intact, along with the perfect bloodline and immense talent, he was determined to enjoy his new life, using his extraordinary magical abilities to master the study of magic that was beyond his reach in his previous life!",
      "watch_url": "https://aniwatchtv.to/watch/i-was-reincarnated-as-the-7th-prince-so-i-can-take-my-time-perfecting-my-magical-ability-season-2-19781",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/b5223da8ccda6eda699ecb403fca068a.jpg",
      "stream_url": ""
    },
    {
      "title": "The Rising of the Shield Hero Season 4",
      "description": "The Four Cardinal Heroes are a group of ordinary men from modern-day Japan summoned to the kingdom of Melromarc to become its saviors. Melromarc is a country plagued by the Waves of Catastrophe that have repeatedly ravaged the land and brought disaster to its citizens for centuries. The four heroes are respectively bestowed a sword, spear, bow, and shield to vanquish these Waves. Naofumi Iwatani, an otaku, becomes cursed with the fate of being the \"Shield Hero.\" Armed with only a measly shield, Naofumi is belittled and ridiculed by his fellow heroes and the kingdom's people due to his weak offensive capabilities and lackluster personality.\r\n\r\nWhen the heroes are provided with resources and comrades to train with, Naofumi sets out with the only person willing to train alongside him, Malty Melromarc. He is soon betrayed by her, however, and becomes falsely accused of taking advantage of her. Naofumi then becomes heavily discriminated against and hated by the people of Melromarc for something he didn't do. With a raging storm of hurt and mistrust in his heart, Naofumi begins his journey of strengthening himself and his reputation. Further along however, the difficulty of being on his own sets in, so Naofumi buys a demi-human slave on the verge of death named Raphtalia to accompany him on his travels.\r\n\r\nAs the Waves approach the kingdom, Naofumi and Raphtalia must fight for the survival of the kingdom and protect the people of Melromarc from their ill-fated future.",
      "watch_url": "https://aniwatchtv.to/watch/the-rising-of-the-shield-hero-season-4-19790",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/9f8713514ab999b515c4a96eeae87e20.jpg",
      "stream_url": ""
    },
    {
      "title": "Sakamoto Days Part 2",
      "description": "The legendary former hitman Tarou Sakamoto has thwarted numerous assassins after an enormous bounty on his head was issued. But he cannot seem to catch a break and simply take it easy with his beloved family. A mysterious and infamous figure known as Slur has brought a group of insane death row inmates to Japan, who hold back from nothing to eliminate their targets.\r\n\r\nSakamoto is not the only target—the criminals have been assigned to kill various other people, including the new hires at Sakamoto's convenience store, Shin Asakura and Lu Shaotang. The situation escalates even further when the Order, a group of the most skilled Japanese assassins, becomes involved. As the inmates begin wreaking havoc, Sakamoto and his allies must remain vigilant for the sake of everything they hold dear.",
      "watch_url": "https://aniwatchtv.to/watch/sakamoto-days-part-2-19787",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/200f6d513c6a0ea46258ef0b2d3d411a.jpg",
      "stream_url": ""
    },
    {
      "title": "One Piece",
      "description": "Gold Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.\r\n\r\nEnter Monkey Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.\r\n\r\n[Written by MAL Rewrite]",
      "watch_url": "https://aniwatchtv.to/watch/one-piece-100",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/1366x768/100/db8603d2f4fa78e1c42f6cf829030a18.jpg",
      "stream_url": ""
    }
  ],
  "latest_episodes": [
    {
      "title": "Puniru is a Kawaii Slime Season 2",
      "watch_url": "https://aniwatchtv.to/puniru-is-a-kawaii-slime-season-2-19734",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/a700000d4c4f6e959c69d353fc2a9c31.png",
      "stream_url": null
    },
    {
      "title": "Toilet-Bound Hanako-kun Season 2 Part 2",
      "watch_url": "https://aniwatchtv.to/toilet-bound-hanako-kun-season-2-part-2-19771",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/31e9bf1d374c8eb4d0011159dbc896c2.jpg",
      "stream_url": null
    },
    {
      "title": "Battle Through The Heavens 5th Season",
      "watch_url": "https://aniwatchtv.to/battle-through-the-heavens-5th-season-18119",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/069e39f99972004849bab4a2946d968c.jpg",
      "stream_url": null
    },
    {
      "title": "Witch Watch",
      "watch_url": "https://aniwatchtv.to/witch-watch-19552",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/80082b698ed84bf8d784d299faf50124.jpg",
      "stream_url": null
    },
    {
      "title": "A Record of Mortal's Journey to Immortality Season 3",
      "watch_url": "https://aniwatchtv.to/a-record-of-mortals-journey-to-immortality-season-3-19015",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/c113cfdf822840adf77c553d59794d85.jpg",
      "stream_url": null
    },
    {
      "title": "Nine: Ruler's Crown",
      "watch_url": "https://aniwatchtv.to/nine-rulers-crown-19741",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/bdeccca4a2f866aba719dcdb640cb8e7.jpg",
      "stream_url": null
    },
    {
      "title": "Punirunes: Puni 3",
      "watch_url": "https://aniwatchtv.to/punirunes-puni-3-19810",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f2e1961fa1f8ca51c8a40908c049118f.jpg",
      "stream_url": null
    },
    {
      "title": "Nmeneko",
      "watch_url": "https://aniwatchtv.to/nmeneko-19697",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/6cc697363ca9cfa1498346961d0c9717.jpg",
      "stream_url": null
    },
    {
      "title": "You and Idol Precure♪",
      "watch_url": "https://aniwatchtv.to/you-and-idol-precure-19509",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/890b72a89c29f9f02ffe82bdbf1f8298.jpg",
      "stream_url": null
    },
    {
      "title": "The Fragrant Flower Blooms with Dignity",
      "watch_url": "https://aniwatchtv.to/the-fragrant-flower-blooms-with-dignity-19789",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f0b91bbbd75c16315c767bf3a9c8a3fc.jpg",
      "stream_url": null
    },
    {
      "title": "With You and the Rain",
      "watch_url": "https://aniwatchtv.to/with-you-and-the-rain-19762",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/cd4753d8a4d3ba94607dd9f60b23e3a6.jpg",
      "stream_url": null
    },
    {
      "title": "The Summer Hikaru Died",
      "watch_url": "https://aniwatchtv.to/the-summer-hikaru-died-19783",
      "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/59ecd5571fb25e6b09ff27f580fd2fbb.jpg",
      "stream_url": null
    }
  ]
}